'''
Помислете как онлайн продавач ще организира базата си от данни за музикални продукти за продан.
Да кажем, че има 3 вида продукти: CD, Vinyl и Download. Всички те ще имат общи атрибути като:
artist, title, price и tracklist, но и всеки продукт ще има свои собствени атрибути: downloadQuality, vinylSize и shippingCost.
Реализирайте йерархията от класове, така че да няма класове с еднакви атрибути.
Предвид, че има различни видове продукти, значи че има и различни начини те да се купят. 
Освен класовете за продукти има класове, които продават всеки отделен вид продукт. Всеки "продавач" може да 
продава определен продукт "sell(item)", но всеки "продавач" го прави по различен начин. 
Дефинирайте изключение MethodNotImplementedError, което ще възникне, ако се извика "sell" и той не е имплементиран.
'''
